[
  "Ashutosh Singh\n| +91 9235654235 | LinkedIn\n– – ashutoshworks.8@gmail.com\n•HackerRank Problem Solving Basic\n• Build With India Hackathon| Link (Jan 2024)\n| Link (Dec 2024)•Computer Science and Engineering | ABES Engineering College, Ghaziabad\n•Programming Languages : C++, Python Github\nComputer Science student passionate about backend development with hands-on experience in C++, Python, and",
  "SQL. Skilled in building real-world projects beyond the classroom with a focus on scalable, impactful solutions.\nEager to solve meaningful problems, experiment, and learn fast. Familiar with Git. Excited to contribute and grow\nwith mission-driven teams\n 93.8% | 2021\n91.2% | 2019\n, \n•Movie Recommender System| Link \n– Developed a movie recommendation system using Python and scikit-learn for personalized suggestions\nvectorization and cosine similarity to compute movie similarities.",
  "– Predicts movies with upto 95% accuracy rate.•AgriPulse | Link \n– |\nProjectsEducation\nCertiﬁcatesTechnical Skills\nExtracurricularProfessional Summary\nBuilt a full-stackAI-powered farming assistant using React.js, Firebase, and TypeScript that \n enhancing yields by up to 45% through data-driven decision support.\nEngineered robust backend with API integration, implemented analytics, error handling, and form",
  "validation to deliver a polished MVP that addresses climate-driven food insecurity for over 60M+\nsmallholder farmers in developing regions.\nPicturesque Club : 2023- 2025\nPost-Production Head\nLead and manage the post-production team, overseeing the editing and enhancement of visual content for\nevents and exhibitions.•Frameworks & Libraries : React.js\n• Database: SQL \n•Tools & Platforms: VS Code, Git, Spyder•Web Technologies: HTML5, CSS, JavaScript, React.js",
  "•Soft Skills: Problem-solving, Time management, Communication, Adaptability, Team Collaboration\nTrain and mentor junior editors, providing guidance on editing techniques and software usage.•XII (CBSE) | Renaissance Academy, Gorakhpur\n•X (CBSE) | G.N.National Public School, Gorakhpur\nImplemented backend logic with FastAPI and OpenAI's GPT models to generate accurate\ncomputations and intelligent responses, improving system efficiency and accuracy.",
  "– Implemented content-based filtering and collaborative filtering techniques to enhance recommendations.\n– Built an interactive web application using Streamlit for seamless user experience. Utilized TF-IDF delivers realtime local weather forecasts, crop advisories, and irrigation tips to rural farmers"
]